Table of Contents
 Class GrpcReflectionInvokeData
Namespace
IdeaStatiCa.Plugin.Grpc.Reflection
Assembly
IdeaStatiCa.Plugin.dll
Invokes a method over Grpc.
public class GrpcReflectionInvokeData
Inheritance
object
GrpcReflectionInvokeData
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 MethodName
Nethod name to invoke.
public string MethodName { get; set; }
Property Value
string
 Parameters
Method parameters.
public IEnumerable<GrpcReflectionArgument> Parameters { get; set; }
Property Value
IEnumerable<GrpcReflectionArgument>
 Edit this page